Feature: signup
  کاربر جدید وارد سایت شده و برای ثبت نام در سایت وارد قسمت ثبت نام می شود.
  

    Background: ثبت نام
          کاربر در صفحه ثبت‌نام قرار دارد
  

  
  
    Scenario Outline: Correct signup
    
    Given کاربر در صفحه ثبت نام قرار دارد
    When کاربر تمام فیلد ها را به صورت صحیح وارد می‌کند
    And کاربر روی دکمه ثبت‌نام کلیک می‌کند
    Then پیام موفقیت ثبت‌نام با موفقیت انجام شد نمایش داده می‌شود
        
    
  
   Scenario Outline: signup without name
    
    Given کاربر در صفحه ثبت نام قرار دارد
    When کاربر تمام فیلد ها را به جز فیلد نام به صورت صحیح وارد می کند
    And کاربر روی دکمه ثبت‌نام کلیک می‌کند
    Then پیام خطای وارد کردن نام الزامی است نمایش داده می‌شود
    
    

  Scenario Outline: signup without last name
    
    Given کاربر در صفحه ثبت نام قرار دارد
    When کاربر تمام فیلد ها را به جز فیلد نام خانوادگی به صورت صحیح وارد می کند
    And کاربر روی دکمه ثبت‌نام کلیک می‌کند
    Then پیام خطای وارد کردن نام خانوادگی الزامی است نمایش داده می‌شود



Scenario Outline: signup without national code
    
    Given کاربر در صفحه ثبت نام قرار دارد
    When کاربر تمام فیلد ها را به جز فیلد کد ملی به صورت صحیح وارد می کند
    And کاربر روی دکمه ثبت‌نام کلیک می‌کند
    Then پیام خطای وارد کردن کد ملی الزامی است نمایش داده می‌شود



Scenario Outline: signup without mobie.NO
    
    Given کاربر در صفحه ثبت نام قرار دارد
    When کاربر تمام فیلد ها را به جز فیلد شماره موبایل به صورت صحیح وارد می کند
    And کاربر روی دکمه ثبت‌نام کلیک می‌کند
    Then پیام خطای وارد کردن شماره موبایل الزامی است نمایش داده می‌شود


Scenario Outline: signup without date of birth
    
    Given کاربر در صفحه ثبت نام قرار دارد
    When کاربر تمام فیلد ها را به جز فیلد تاریخ تولد به صورت صحیح وارد می کند
    And کاربر روی دکمه ثبت‌نام کلیک می‌کند
    Then پیام خطای وارد کردن تاریخ تولد الزامی است نمایش داده می‌شود


Scenario Outline: signup without password
    
    Given کاربر در صفحه ثبت نام قرار دارد
    When کاربر تمام فیلد ها را به جز فیلد پسورد به صورت صحیح وارد می کند
    And کاربر روی دکمه ثبت‌نام کلیک می‌کند
    Then پیام خطای وارد کردن پسورد الزامی است نمایش داده می‌شود


Scenario Outline: signup without re password
    
    Given کاربر در صفحه ثبت نام قرار دارد
    When کاربر تمام فیلد ها را به جز فیلد تکرار پسورد به صورت صحیح وارد می کند
    And کاربر روی دکمه ثبت‌نام کلیک می‌کند
    Then پیام خطای وارد کردن تکرار پسورد الزامی است نمایش داده می‌شود



    
#   Scenario Outline: فیلد نام با کاراکتر کمتر از 2 کاراکتر   
 
#     When کاربر فیلد نام را با یک کاراکترحروفی وارد می‌کند
#     And کاربر فیلد نام خانوادگی را به صورت صحیح وارد می‌کند
#     And کاربر فیلد کد ملی را به صورت صحیح وارد می‌کند
#     And کاربر فیلد شماره موبایل را به صورت صحیح وارد می‌کند
#     And کاربر تاریخ تولد معتبر را از تقویم انتخاب می‌کند
#     And کاربر فیلد رمز عبور را به صورت صحیح وارد می‌کند
#     And کاربر فیلد تکرار رمز عبور را به صورت صحیح وارد می‌کند
#     And کاربر روی دکمه ثبت‌نام کلیک می‌کند
#     Then پیام خطای نام باید حداقل 3 کاراکتر باشد نمایش داده می‌شود
    
    
    
  
#   Scenario Outline: فیلد نام خانوادگی با کاراکتر زیاد
#     نام خانوادگی بیش از 40 کاراکتر باشد
    
    
#     When کاربر فیلد نام را به صورت صحیح وارد می‌کند
#     And کاربر فیلد نام خانوادگی را با یک عبارت بیش از 30 کاراکتر وارد می‌کند
#     And کاربر فیلد کد ملی را به صورت صحیح وارد می‌کند
#     And کاربر فیلد شماره موبایل را به صورت صحیح وارد می‌کند
#     And کاربر تاریخ تولد معتبر را از تقویم انتخاب می‌کند
#     And کاربر فیلد رمز عبور را به صورت صحیح وارد می‌کند
#     And کاربر فیلد تکرار رمز عبور را به صورت صحیح وارد می‌کند
#     And کاربر روی دکمه ثبت‌نام کلیک می‌کند
#     Then پیام خطای نام خانوادگی نمی‌تواند بیش از 40 کاراکتر باشد نمایش داده می‌شود
    
    


    
  
  Scenario Outline: signup without national code less than 10 characters
    
  Given کاربر در صفحه ثبت نام قرار دارد
  When کاربر تمام فیلد ها را به جز فیلد کد ملی تکمیل می کند
  And کاربر فیلد کد ملی را با کمتر از 10 کاراکتر پر می کند
  And کاربر روی دکمه ثبت‌نام کلیک می‌کند
  Then پیام کد ملی باید 10 رقم باشد نمایش داده می‌شود

    
    
      
    
 Scenario Outline: signup without Invalid national code
    
  Given کاربر در صفحه ثبت نام قرار دارد
  When کاربر تمام فیلد ها را به جز فیلد کد ملی تکمیل می کند
  And کاربر فیلد کد ملی را با کد ملی نا معتبر پر می کند
  And کاربر روی دکمه ثبت‌نام کلیک می‌کند
  Then پیام کد ملی صحیح نمی باشد نمایش داده می‌شود
    
    
  
  Scenario Outline: signup without mobie.NO less than 11 characters
    
  Given کاربر در صفحه ثبت نام قرار دارد
  When کاربر تمام فیلد ها را به جز فیلد شماره موبایل تکمیل می کند
  And کاربر فیلد شماره موبایل را با کمتر از 11 کاراکتر پر می کند
  And کاربر روی دکمه ثبت‌نام کلیک می‌کند
  Then پیام شماره موبایل باید 11 رقم باشد نمایش داده می‌شود
    
    
  
#   Scenario Outline: شماره موبایل نا معتبر
#     شماره موبایل شامل حروف باشد
    
    
#     When کاربر فیلد نام را به صورت صحیح وارد می‌کند
#     And کاربر فیلد نام خانوادگی را به صورت صحیح وارد می‌کند
#     And کاربر فیلد کد ملی را به صورت صحیح وارد می‌کند
#     And کاربر فیلد شماره موبایل را به صورت نا درست با کاراکتر های حروفی وارد می‌کند
#     And کاربر تاریخ تولد معتبر را از تقویم انتخاب می‌کند
#     And کاربر فیلد رمز عبور را به صورت صحیح وارد می‌کند
#     And کاربر فیلد تکرار رمز عبور را به صورت صحیح وارد می‌کند
#     And کاربر روی دکمه ثبت‌نام کلیک می‌کند
#     Then پیام خطای شماره موبایل باید فقط عددی باشد نمایش داده می‌شود
    
    
    
  
#   Scenario Outline: سن کمتر از حد مجاز
#     سن کمتر از ۱۸ سال باشد
    
    
#     When کاربر فیلد نام را به صورت صحیح وارد می‌کند
#     And کاربر فیلد نام خانوادگی را به صورت صحیح وارد می‌کند
#     And کاربر فیلد کد ملی را به صورت صحیح وارد می‌کند
#     And کاربر فیلد شماره موبایل را به صورت صحیح وارد می‌کند
#     And کاربر تاریخ تولد را از تقویم برای کمتر از 18 سال انتخاب می‌کند
#     And کاربر فیلد رمز عبور را به صورت صحیح وارد می‌کند
#     And کاربر فیلد تکرار رمز عبور را به صورت صحیح وارد می‌کند
#     And کاربر روی دکمه ثبت‌نام کلیک می‌کند
#     Then پیام خطای سن کاربر باید حداقل ۱۸ سال باشد نمایش داده می‌شود
    
    
    
  
#   Scenario Outline: سن بیشتر از حد مجاز
#     سن بیشتر از ۱۲۰ سال باشد
    
    
#     When کاربر فیلد نام را به صورت صحیح وارد می‌کند
#     And کاربر فیلد نام خانوادگی را به صورت صحیح وارد می‌کند
#     And کاربر فیلد کد ملی را به صورت صحیح وارد می‌کند
#     And کاربر فیلد شماره موبایل را به صورت صحیح وارد می‌کند
#     And کاربر تاریخ تولد معتبر را برای سن بیش تر از 120 سال انتخاب می‌کند
#     And کاربر فیلد رمز عبور را به صورت صحیح وارد می‌کند
#     And کاربر فیلد تکرار رمز عبور را به صورت صحیح وارد می‌کند
#     And کاربر روی دکمه ثبت‌نام کلیک می‌کند
#     Then پیام خطای سن نباید بیشتر از ۱۲۰ سال باشد نمایش داده می‌شود
    
    
    
  
#   Scenario Outline: رمز عبور ساده
#     رمز عبور ساده باشد
    
    
#     When کاربر فیلد نام را به صورت صحیح وارد می‌کند
#     And کاربر فیلد نام خانوادگی را به صورت صحیح وارد می‌کند
#     And کاربر فیلد کد ملی را به صورت صحیح وارد می‌کند
#     And کاربر فیلد شماره موبایل را به صورت صحیح وارد می‌کند
#     And کاربر تاریخ تولد معتبر را از تقویم انتخاب می‌کند
#     And کاربر فیلد رمز عبور را با تعداد کاراکر های فقط عددی و کم وارد می‌کند
#     And کاربر فیلد تکرار رمز عبور را به صورت صحیح وارد می‌کند
#     And کاربر روی دکمه ثبت‌نام کلیک می‌کند
#     Then پیام خطای رمز عبور باید شامل حروف بزرگ، کوچک، عدد و کاراکتر خاص باشد نمایش داده می‌شود
    
    
    
  
#   Scenario Outline: تکرار رمز عبور نادرست
#     عدم تطابق رمز عبور و تکرار آن
    
    
#     When کاربر فیلد نام را به صورت صحیح وارد می‌کند
#     And کاربر فیلد نام خانوادگی را به صورت صحیح وارد می‌کند
#     And کاربر فیلد کد ملی را به صورت صحیح وارد می‌کند
#     And کاربر فیلد شماره موبایل را به صورت صحیح وارد می‌کند
#     And کاربر تاریخ تولد معتبر را از تقویم انتخاب می‌کند
#     And کاربر فیلد رمز عبور را به صورت صحیح وارد می‌کند
#     And کاربر فیلد تکرار رمز عبور را به صورت ناصحیح و مغایر با رمز عبور وارد می‌کند
#     And کاربر روی دکمه ثبت‌نام کلیک می‌کند
#     Then پیام خطای تکرار رمز عبور باید با رمز عبور یکسان باشد نمایش داده می‌شود
    
    
    
  
#   Scenario Outline: کاراکترهای غیرمجاز در نام
#     استفاده از کاراکترهای غیرمجاز در نام
    
    
#     When کاربر در فیلد نام کاراکتر های نا معتبر وارد می‌کند
#     And کاربر فیلد نام خانوادگی را به صورت صحیح وارد می‌کند
#     And کاربر فیلد کد ملی را به صورت صحیح وارد می‌کند
#     And کاربر فیلد شماره موبایل را به صورت صحیح وارد می‌کند
#     And کاربر تاریخ تولد معتبر را از تقویم انتخاب می‌کند
#     And کاربر فیلد رمز عبور را به صورت صحیح وارد می‌کند
#     And کاربر فیلد تکرار رمز عبور را به صورت صحیح وارد می‌کند
#     And کاربر روی دکمه ثبت‌نام کلیک می‌کند
#     Then پیام خطای نام فقط باید شامل حروف فارسی باشد نمایش داده می‌شود
    
    
    
  
#   Scenario Outline: کد ملی تکراری
#     ثبت‌نام با کد ملی تکراری
    
    
#     When کاربر فیلد نام را به صورت صحیح وارد می‌کند
#     And کاربر فیلد نام خانوادگی را به صورت صحیح وارد می‌کند
#     And کاربر فیلد کد ملی  اطلاعات کد ملی فردی که قبلا ثبت نام کرده را وارد می‌کند
#     And کاربر فیلد شماره موبایل را به صورت صحیح وارد می‌کند
#     And کاربر تاریخ تولد معتبر را از تقویم انتخاب می‌کند
#     And کاربر فیلد رمز عبور را به صورت صحیح وارد می‌کند
#     And کاربر فیلد تکرار رمز عبور را به صورت صحیح وارد می‌کند
#     And کاربر روی دکمه ثبت‌نام کلیک می‌کند
#     Then پیام خطای این کد ملی قبلاً ثبت شده است نمایش داده می‌شود
    
    
    
  
#   Scenario Outline: عدم وجود کاراکتر خاص
#     استفاده از رمز عبور بدون کاراکتر خاص
    
    
#     When کاربر فیلد نام را به صورت صحیح وارد می‌کند
#     And کاربر فیلد نام خانوادگی را به صورت صحیح وارد می‌کند
#     And کاربر فیلد کد ملی را به صورت صحیح وارد می‌کند
#     And کاربر فیلد شماره موبایل را به صورت صحیح وارد می‌کند
#     And کاربر تاریخ تولد معتبر را از تقویم انتخاب می‌کند
#     And کاربر فیلد رمز عبور را بدون کاراکتر های خاص وارد می‌کند
#     And کاربر فیلد تکرار رمز عبور را به صورت صحیح وارد می‌کند
#     And کاربر روی دکمه ثبت‌نام کلیک می‌کند
#     Then پیام خطای رمز عبور باید حداقل شامل یک کاراکتر خاص باشد نمایش داده می‌شود
    
    
    
  
#   Scenario Outline: عدم وجود حروف بزرگ
#     رمز عبور بدون حروف بزرگ
    
    
#     When کاربر فیلد نام را به صورت صحیح وارد می‌کند
#     And کاربر فیلد نام خانوادگی را به صورت صحیح وارد می‌کند
#     And کاربر فیلد کد ملی را به صورت صحیح وارد می‌کند
#     And کاربر فیلد شماره موبایل را به صورت صحیح وارد می‌کند
#     And کاربر تاریخ تولد معتبر را از تقویم انتخاب می‌کند
#     And کاربر فیلد رمز عبور را بدون کاراکتر های حروفی بزرگ لاتین وارد می‌کند
#     And کاربر فیلد تکرار رمز عبور را به صورت صحیح وارد می‌کند
#     And کاربر روی دکمه ثبت‌نام کلیک می‌کند
#     Then پیام خطای رمز عبور باید حداقل شامل یک حرف بزرگ باشد نمایش داده می‌شود
    
    
    
  
#   Scenario Outline: فرمت اشتباه تاریخ تولد
#     تاریخ تولد با فرمت اشتباه وارد شود
    
    
#     When کاربر فیلد نام را به صورت صحیح وارد می‌کند
#     And کاربر فیلد نام خانوادگی را به صورت صحیح وارد می‌کند
#     And کاربر فیلد کد ملی را به صورت صحیح وارد می‌کند
#     And کاربر فیلد شماره موبایل را به صورت صحیح وارد می‌کند
#     And کاربر فیلد تاریخ تولد را به صورت دستی با فرمت متفاوت وارد می‌کند
#     And کاربر فیلد رمز عبور را به صورت صحیح وارد می‌کند
#     And کاربر فیلد تکرار رمز عبور را به صورت صحیح وارد می‌کند
#     And کاربر روی دکمه ثبت‌نام کلیک می‌کند
#     Then پیام خطای فرمت تاریخ تولد نامعتبر است نمایش داده می‌شود
    
    
    
  
#   Scenario Outline: کاراکتر لاتبن در فیلدنام
#     استفاده از نویسه‌های غیر فارسی در نام
    
    
#     When کاربر فیلد نام را با کاراکتر های لاتین وارد می‌کند
#     And کاربر فیلد نام خانوادگی را به صورت صحیح وارد می‌کند
#     And کاربر فیلد کد ملی را به صورت صحیح وارد می‌کند
#     And کاربر فیلد شماره موبایل را به صورت صحیح وارد می‌کند
#     And کاربر تاریخ تولد معتبر را از تقویم انتخاب می‌کند
#     And کاربر فیلد رمز عبور را به صورت صحیح وارد می‌کند
#     And کاربر فیلد تکرار رمز عبور را به صورت صحیح وارد می‌کند
#     And کاربر روی دکمه ثبت‌نام کلیک می‌کند
#     Then پیام خطای لطفاً نام را به زبان فارسی وارد کنید نمایش داده می‌شود
    
    
    
  
#   Scenario Outline: کاراکتر نامعتبر در نام خانوادگی
#     وارد کردن کاراکترهای اسپشیال در نام خانوادگی
    
    
#     When کاربر فیلد نام را به صورت صحیح وارد می‌کند
#     And کاربر فیلد نام خانوادگی را با کارکتر های خاص وارد می‌کند
#     And کاربر فیلد کد ملی را به صورت صحیح وارد می‌کند
#     And کاربر فیلد شماره موبایل را به صورت صحیح وارد میکند
#     And کاربر تاریخ تولد معتبر را از تقویم انتخاب می‌کند
#     And کاربر فیلد رمز عبور را به صورت صحیح وارد می‌کند
#     And کاربر فیلد تکرار رمز عبور را به صورت صحیح وارد می‌کند
#     And کاربر روی دکمه ثبت‌نام کلیک می‌کند
#     Then پیام خطای نام خانوادگی نباید شامل کاراکترهای غیرمجاز باشد نمایش داده می‌شود
