Feature: signup
  کاربر جدید وارد سایت شده و برای ثبت نام در سایت وارد قسمت ثبت نام می شود.
  

  Background: ثبت نام
          کاربر در صفحه ثبت‌نام قرار دارد
  

  
  
  Scenario Outline: Correct signup
    
    Given کاربر در صفحه ثبت نام قرار دارد
    When کاربر تمام فیلد ها را به صورت صحیح وارد می‌کند
    And کاربر روی دکمه ثبت‌نام کلیک می‌کند
    Then پیام موفقیت ثبت‌نام با موفقیت انجام شد نمایش داده می‌شود
        
    
  
  Scenario Outline: signup without name
    
    Given کاربر در صفحه ثبت نام قرار دارد
    When کاربر تمام فیلد ها را به جز فیلد نام به صورت صحیح وارد می کند
    And کاربر روی دکمه ثبت‌نام کلیک می‌کند
    Then پیام خطای وارد کردن نام الزامی است نمایش داده می‌شود
    
    

  Scenario Outline: signup without last name
    
    Given کاربر در صفحه ثبت نام قرار دارد
    When کاربر تمام فیلد ها را به جز فیلد نام خانوادگی به صورت صحیح وارد می کند
    And کاربر روی دکمه ثبت‌نام کلیک می‌کند
    Then پیام خطای وارد کردن نام خانوادگی الزامی است نمایش داده می‌شود



  Scenario Outline: signup without national code
    
    Given کاربر در صفحه ثبت نام قرار دارد
    When کاربر تمام فیلد ها را به جز فیلد کد ملی به صورت صحیح وارد می کند
    And کاربر روی دکمه ثبت‌نام کلیک می‌کند
    Then پیام خطای وارد کردن کد ملی الزامی است نمایش داده می‌شود



  Scenario Outline: signup without mobie.NO
    
    Given کاربر در صفحه ثبت نام قرار دارد
    When کاربر تمام فیلد ها را به جز فیلد شماره موبایل به صورت صحیح وارد می کند
    And کاربر روی دکمه ثبت‌نام کلیک می‌کند
    Then پیام خطای وارد کردن شماره موبایل الزامی است نمایش داده می‌شود


  Scenario Outline: signup without date of birth
    
    Given کاربر در صفحه ثبت نام قرار دارد
    When کاربر تمام فیلد ها را به جز فیلد تاریخ تولد به صورت صحیح وارد می کند
    And کاربر روی دکمه ثبت‌نام کلیک می‌کند
    Then پیام خطای وارد کردن تاریخ تولد الزامی است نمایش داده می‌شود


  Scenario Outline: signup without password
    
    Given کاربر در صفحه ثبت نام قرار دارد
    When کاربر تمام فیلد ها را به جز فیلد پسورد به صورت صحیح وارد می کند
    And کاربر روی دکمه ثبت‌نام کلیک می‌کند
    Then پیام خطای وارد کردن پسورد الزامی است نمایش داده می‌شود


  Scenario Outline: signup without re password
    
    Given کاربر در صفحه ثبت نام قرار دارد
    When کاربر تمام فیلد ها را به جز فیلد تکرار پسورد به صورت صحیح وارد می کند
    And کاربر روی دکمه ثبت‌نام کلیک می‌کند
    Then پیام خطای وارد کردن تکرار پسورد الزامی است نمایش داده می‌شود



    
#   Scenario Outline: فیلد نام با کاراکتر کمتر از 2 کاراکتر   
 
#     When کاربر فیلد نام را با یک کاراکترحروفی وارد می‌کند
#     And کاربر فیلد نام خانوادگی را به صورت صحیح وارد می‌کند
#     And کاربر فیلد کد ملی را به صورت صحیح وارد می‌کند
#     And کاربر فیلد شماره موبایل را به صورت صحیح وارد می‌کند
#     And کاربر تاریخ تولد معتبر را از تقویم انتخاب می‌کند
#     And کاربر فیلد رمز عبور را به صورت صحیح وارد می‌کند
#     And کاربر فیلد تکرار رمز عبور را به صورت صحیح وارد می‌کند
#     And کاربر روی دکمه ثبت‌نام کلیک می‌کند
#     Then پیام خطای نام باید حداقل 3 کاراکتر باشد نمایش داده می‌شود
    
    
    
  
#   Scenario Outline: فیلد نام خانوادگی با کاراکتر زیاد
#     نام خانوادگی بیش از 40 کاراکتر باشد
    
    
#     When کاربر فیلد نام را به صورت صحیح وارد می‌کند
#     And کاربر فیلد نام خانوادگی را با یک عبارت بیش از 30 کاراکتر وارد می‌کند
#     And کاربر فیلد کد ملی را به صورت صحیح وارد می‌کند
#     And کاربر فیلد شماره موبایل را به صورت صحیح وارد می‌کند
#     And کاربر تاریخ تولد معتبر را از تقویم انتخاب می‌کند
#     And کاربر فیلد رمز عبور را به صورت صحیح وارد می‌کند
#     And کاربر فیلد تکرار رمز عبور را به صورت صحیح وارد می‌کند
#     And کاربر روی دکمه ثبت‌نام کلیک می‌کند
#     Then پیام خطای نام خانوادگی نمی‌تواند بیش از 40 کاراکتر باشد نمایش داده می‌شود
    
    


    
  
Scenario Outline: signup without national code less than 10 characters
    
  Given کاربر در صفحه ثبت نام قرار دارد
  When کاربر تمام فیلد ها را به جز فیلد کد ملی تکمیل می کند
  And کاربر فیلد کد ملی را با کمتر از 10 کاراکتر پر می کند
  And کاربر روی دکمه ثبت‌نام کلیک می‌کند
  Then پیام کد ملی باید 10 رقم باشد نمایش داده می‌شود

    
    
      
    
Scenario Outline: signup without Invalid national code
    
  Given کاربر در صفحه ثبت نام قرار دارد
  When کاربر تمام فیلد ها را به جز فیلد کد ملی تکمیل می کند
  And کاربر فیلد کد ملی را با کد ملی نا معتبر پر می کند
  And کاربر روی دکمه ثبت‌نام کلیک می‌کند
  Then پیام کد ملی صحیح نمی باشد نمایش داده می‌شود
    
    
  
Scenario Outline: signup without mobie.NO less than 11 characters
    
  Given کاربر در صفحه ثبت نام قرار دارد
  When کاربر تمام فیلد ها را به جز فیلد شماره موبایل تکمیل می کند
  And کاربر فیلد شماره موبایل را با کمتر از 11 کاراکتر پر می کند
  And کاربر روی دکمه ثبت‌نام کلیک می‌کند
  Then پیام شماره موبایل باید 11 رقم باشد نمایش داده می‌شود
    
       
    
  
Scenario Outline: signup without Minimum age requirement 
     
  Given کاربر در صفحه ثبت نام قرار دارد
  When کاربر تمام فیلد ها را به جز فیلد تاریخ تولد تکمیل می کند
  And کاربر فیلد تاریخ تولد را برای سن کمتر از 18 سال پر می کند
  And کاربر روی دکمه ثبت‌نام کلیک می‌کند
  Then پیام تاریخ تولد باید بزرگتر از 18 سال باشد نمایش داده می‌شود
    
    
    
  
Scenario Outline: signup without Maximum age requirement 
      
  Given کاربر در صفحه ثبت نام قرار دارد
  When کاربر تمام فیلد ها را به جز فیلد تاریخ تولد تکمیل می کند
  And کاربر فیلد تاریخ تولد را برای سن بیشتر از 120 سال پر می کند
  And کاربر روی دکمه ثبت‌نام کلیک می‌کند
  Then پیام تاریخ تولد باید کوچکتر از 120 سال باشد نمایش داده می‌شود
    
    
    
  
Scenario Outline: signup without easy password
      
  Given کاربر در صفحه ثبت نام قرار دارد
  When کاربر تمام فیلد ها را به جز فیلد پسورد تکمیل می کند
  And کاربر فیلد پسورد را با تعداد کاراکتر کمتر از 8 کاراکتر تکمیل می کند
  And کاربر روی دکمه ثبت‌نام کلیک می‌کند
  Then پیام تعداد کاراکتر می بایست حداقل 8 کاراکتر باشد نمایش داده می‌شود
  When کاربر فیلد پسورد را با بدون وارد کردن حروف بزرگ تکمیل می کند
  Then پیام رمز عبور باید حداقل یک حرف بزرگ داشته باشد نمایش داده می‌شود
  When کاربر فیلد پسورد را بدون وارد کردن علامت خاص تکمیل می کند 
  Then پیام رمز عبور باید حداقل یک حرف خاص داشته باشد نمایش داده می‌شود
    
  

Scenario Outline: signup without repeat incorrect password
   
  Given کاربر در صفحه ثبت نام قرار دارد
  When کاربر تمام فیلد ها را به جز فیلد تکرار رمز عبور تکمیل می کند
  And کاربر فیلد تکرار رمز عبور را برای متفاوت ار فیلد رمز عبور پر می کند
  And کاربر روی دکمه ثبت‌نام کلیک می‌کند
  Then پیام رمز عبور و تکرار آن یکسان نمی باشد نمایش داده می‌شود
    
    
    
  
Scenario Outline: signup without First and last name illegal characters
    
  Given کاربر در صفحه ثبت نام قرار دارد
  When کاربر تمام فیلد ها را به جز فیلد نام و نام خانوادگی تکمیل می کند
  And کاربر فیلد نام را با کاراکتر های نا مجاز پر می کند
  And کاربر روی دکمه ثبت‌نام کلیک می‌کند
  Then پیام نام باید به صورت فارسی باشد نمایش داده می‌شود
  When کاربر فیلد نام خانوادگی را با کاراکتر های نا مجاز پر می کند
  Then پیام نام خانوادگی باید به صورت فارسی باشد نمایش داده می‌شود
    
    
    
  
Scenario Outline: signup without English first and last name
    
  Given کاربر در صفحه ثبت نام قرار دارد
  When کاربر تمام فیلد ها را به جز فیلد نام و نام خانوادگی تکمیل می کند
  And کاربر فیلد نام را با کاراکتر های انگلیسی پر می کند
  And کاربر روی دکمه ثبت‌نام کلیک می‌کند
  Then پیام نام باید به صورت فارسی باشد نمایش داده می‌شود
  When کاربر فیلد نام خانوادگی را با کاراکتر های انگلیسی پر می کند
  Then پیام نام خانوادگی باید به صورت فارسی باشد نمایش داده می‌شود



  
Scenario: signup without Duplicate national code
       
  Given کاربر در صفحه ثبت نام قرار دارد
  When کاربر تمام فیلد ها را به جز فیلد کد ملی تکمیل می کند
  And کاربر فیلد کد ملی را با کد ملی تکراری پر می کند
  And کاربر روی دکمه ثبت‌نام کلیک می‌کند
  Then پیام متقاضی با این کد ملی قبلا ثبت شده است نمایش داده می‌شود

    
    
     
Scenario: signup without Birth date in wrong format
    
  Given کاربر در صفحه ثبت نام قرار دارد
  When کاربر تمام فیلد ها را به غیر از فیلد تاریخ تولد تکمیل می کند
  And کاربر فیلد تاریخ تولد را با داده های نا معتبر پر می کند
  And کاربر روی دکمه ثبت‌ نام کلیک می‌کند
  Then پیام فرمت تاریخ تولد صحیح نمی باشد نمایش داده می‌شود
       